#+TITLE: Emacs Starter Kit (http://github.com/chowdhuryashraf/literate-devops)
** Load Babel Libraries
   :PROPERTIES:
   :CUSTOM_ID: code-block-org-devops
   :END:

#+BEGIN_SRC emacs-lisp
  (org-babel-lob-ingest (expand-file-name "~/org/devops.org"))
  (defun devops()
      (interactive)
      (org-babel-lob-ingest (expand-file-name "~/org/devops.org")))
#+END_SRC

#+RESULTS:
: 19

** Org Agenda files
   :PROPERTIES:
   :CUSTOM_ID: code-block-org-agenda
   :END:
Capture lets you quickly store notes with little interruption of your
work flow.

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("~/org" ))
#+END_SRC

#+RESULTS:
| ~/org | ~/literate-emacs/ |
**** On User or Desktop Environment
#+BEGIN_SRC sh :var path=pwd()   :dir /sudo:root@localhost:/usr/local/bin
  ls -la $path/em.sh
  cp $path/em.sh  em
  chmod 755 em
#+END_SRC

#+RESULTS:
: -rw-rw-r-- 1 frp frp 74 Feb 28 13:27 /home/frp/org/em.sh

**** On Superuser / Server Environment
#+BEGIN_SRC sh :var path=pwd()
ls -la $path/em.sh
cp $path/em.sh  /bin/em
chmod 755 /bin/em
ls -la /bin/em
#+END_SRC

#+RESULTS:
| -rwxr-xr-x | 1 | root | root | 158 | Jan | 22 | 18:06 | /usr/local/src/literate-devops/em.sh |
| -rwxr-xr-x | 1 | root | root | 158 | Jan | 22 | 18:06 | /bin/em                                         |

***** Run Aync
#+NAME: prelude_git_aync
#+BEGIN_SRC python :session :noweb yes :post cmdaync(*this*)
"""<<prelude_git>>"""
#+END_SRC

#+RESULTS: prelude_git_aync
: command  is sended to /tmp/org
**** copy prelude to .emacs.d
#+BEGIN_SRC sh
ls ~/.emacs.d
#+END_SRC

#+RESULTS:
| auto-save-list  |
| CONTRIBUTING.md |
| core            |
| init.el         |
| modules         |
| personal        |
| README.md       |
| sample          |
| themes          |
| utils           |
| vendor          |


#+BEGIN_SRC sh
ls ~/.emacs.d/.git
#+END_SRC

#+RESULTS:
| branches    |
| config      |
| description |
| HEAD        |
| hooks       |
| index       |
| info        |
| logs        |
| objects     |
| packed-refs |
| refs        |

**** Run Prelude for the First time


#+NAME: emacs
#+BEGIN_SRC sh
emacs
#+END_SRC

#+NAME: emacs_aync
#+BEGIN_SRC python :session :noweb yes :post cmdaync(*this*)
"""<<emacs>>"""
#+END_SRC

#+RESULTS: emacs_aync
: command  is sended to /tmp/org
** git update
#+NAME: gitupdate
#+BEGIN_EXAMPLE
sudo apt-get install python-software-properties ;
sudo add-apt-repository ppa:git-core/ppa ;
sudo apt-get update ;
sudo apt-get install git
#+END_EXAMPLE

#+call: cmdaync(gitupdate)

#+RESULTS:
: command  is sended to /tmp/org

#+BEGIN_SRC sh
git --version
#+END_SRC

#+RESULTS:
: git version 2.7.2
